In [75]:
##############################################  Pair Programming Pandas V   #####################################
# En este ejercicio pondremos en pr치ctica los conceptos 
# b치sicos para juntar varios csv que compartan informaci칩n.
# Trabajaremos con tres ficheros diferentes:
# El csv que creamos en el ejercicio de pair programming Pandas IV, 
# d칩nde recordamos eliminamos ciertas columnas que no eran necesarias, 
# y hab칤amos creado nuevas.


# 游늷 NOTA Cuando hag치is la uni칩n considerad que la informaci칩n que m치s 
# nos interesa es la del DataFrame que creamos en el apartado anterior,
#  lo cual determinar치 el tipo de uni칩n.

# Guardad el dataframe nuevo en un csv que usaremos ma침ana en la clase de pair programming

In [76]:
import pandas as pd
import numpy as np
import os
from os import getcwd

In [77]:
df_tiburones3 = pd.read_csv("../Pandas/03-attacks_new1.csv")
df_tiburones3.head(3)

,Case Number,Unnamed: 0,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Time,Species,HREF
0,2018.06.25,0,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...
1,2018.06.18,1,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,AdysonMcNeely,F,11,14h00 -15h00,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...
2,2018.06.09,2,2018.0,Invalid,USA,Hawaii,"Habush, Oahu",Surfing,John Denges,M,48,07h45,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...

In [78]:

# El csv llamado attacks_historico donde tenemos informaci칩n sobre 
# los ataques de tibur칩n previos al a침o 1800, este fichero lo 
# ten칠is un poco mas abajo para descargar.

df_tibuhistorico = pd.read_csv("../Pandas/05-attacks_historico.csv", index_col = 0)
df_tibuhistorico.head(3)

,Case Number,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
6132,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,NaN,...,NaN,V. C. Harvey-Brain,1800.00.00-Corsair-boat.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1800.00.00,1800.00.00,171.0,NaN,NaN
6133,1797.05.28.R,1797.0,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,...,NaN,The Observer 5/28/1797,1797.05.28.R-Cloverdale.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1797.05.28.R,1797.05.28.R,170.0,NaN,NaN
6134,1792.09.12,1792.0,Provoked,ENGLAND,NaN,On the Thames River,Fishing,male,M,NaN,...,NaN,"The Waterford Herald, 9/15/1792",1792.09.12-Thames.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1792.09.12,1792.09.12,169.0,NaN,NaN

In [79]:

# El csv llamado attacks_adicional donde tenemos informaci칩n 
# sobre los ataques de tibur칩n. de nuevo, 
# este fichero lo ten칠is abajo para descargar.


df_tibuadicional = pd.read_csv("../Pandas/05-attacks_adicional.csv", index_col = 0)
df_tibuadicional.head(3)

,Case Number,Fatal (Y/N),Injury,Date
0,2018.06.25,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018
1,2018.06.18,N,Minor injury to left thigh,18-Jun-2018
2,2018.06.09,N,Injury to left lower leg from surfboard skeg,09-Jun-2018

In [80]:

# El principal objetivo de este ejercicio de pair programming
#  es acabar teniendo un 칰nico DataFrame con toda la informaci칩n
#  contenida en los tres csv anteriores.
# Para llevar a cabo nuestro objetivo tendr칠is que seguir los siguientes pasos:
# Cargad los tres ficheros nombrados anteriormente y los exploramos para 
# familizarizarnos con ellos y saber que informaci칩n tienen en com칰n
#  y debatir con tu compa침era como podr칤amos juntar toda la informaci칩n.

In [81]:
# Chequead que los nombres de las columnas ver si se llaman iguales entre dataframes .

nombre_tibu3_des = df_tiburones3.describe()
nombre_tibuhistorico_des = df_tibuhistorico.describe()
nombre_tibuadicional_des = df_tibuadicional.describe()

In [82]:
nombre_tibu3_des

        Unnamed: 0         Year
count  6114.000000  6114.000000
mean   3065.554629  1968.831207
std    1769.652139    43.745920
min       0.000000  1801.000000
25%    1534.250000  1946.000000
50%    3066.500000  1980.000000
75%    4596.750000  2005.000000
max    6131.000000  2018.000000

In [83]:
nombre_tibuhistorico_des

              Year  original order  Unnamed: 22  Unnamed: 23
count   170.000000      170.000000          0.0          0.0
mean    428.617647       86.500000          NaN          NaN
std     744.448512       49.218899          NaN          NaN
min       0.000000        2.000000          NaN          NaN
25%       0.000000       44.250000          NaN          NaN
50%       0.000000       86.500000          NaN          NaN
75%     394.250000      128.750000          NaN          NaN
max    1800.000000      171.000000          NaN          NaN

In [84]:
nombre_tibuadicional_des

       Case Number Fatal (Y/N) Injury  Date
count         6287        5751   6258  6286
unique        6287           8   3729  5431
top     2018.06.25           N  FATAL  1957
freq             1        4284    801    11

In [85]:
nombre_tibu3_col = df_tiburones3.columns
nombre_tibuhistorico_col = df_tibuhistorico.columns
nombre_tibuadicional_col = df_tibuadicional.columns

In [86]:
nombre_tibu3_col

Index(['Case Number', 'Unnamed: 0', 'Year', 'Type', 'Country', 'Area',
       'Location', 'Activity', 'Name', 'Sex ', 'Age', 'Time', 'Species ',
       'HREF'],
      dtype='object')

In [87]:
nombre_tibuhistorico_col

Index(['Case Number', 'Year', 'Type', 'Country', 'Area', 'Location',
       'Activity', 'Name', 'Sex ', 'Age', 'Time', 'Species ',
       'Investigator or Source', 'pdf', 'href formula', 'href',
       'Case Number.1', 'Case Number.2', 'original order', 'Unnamed: 22',
       'Unnamed: 23'],
      dtype='object')

In [88]:
nombre_tibuadicional_col

Index(['Case Number', 'Fatal (Y/N)', 'Injury', 'Date'], dtype='object')

In [89]:
nombre_tibu3_shape = df_tiburones3.shape
nombre_tibuhistorico_shape = df_tibuhistorico.shape
nombre_tibuadicional_shape = df_tibuadicional.shape

In [90]:
nombre_tibu3_shape

(6114, 14)

In [91]:
nombre_tibuhistorico_shape

(170, 21)

In [92]:
nombre_tibuadicional_shape

(6288, 4)

In [93]:
nombre_tibu3_col is nombre_tibuhistorico_des

False

In [94]:
nombre_tibu3 is nombre_tibuhistorico

False

In [95]:
df_tiburones33 = df_tiburones3.drop(["Unnamed: 0"], axis = 1)
df_tiburones33

,Case Number,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Time,Species,HREF
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...
1,2018.06.18,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,AdysonMcNeely,F,11,14h00 -15h00,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...
2,2018.06.09,2018.0,Invalid,USA,Hawaii,"Habush, Oahu",Surfing,John Denges,M,48,07h45,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...
3,2018.06.08,2018.0,Unprovoked,AUSTRALIA,New South Wales,Arrawarra Headland,Surfing,male,M,NaN,NaN,2 m shark,http://sharkattackfile.net/spreadsheets/pdf_di...
4,2018.06.04,2018.0,Provoked,MEXICO,Colima,La Ticla,Free diving,Gustavo Ramos,M,NaN,NaN,"Tiger shark, 3m",http://sharkattackfile.net/spreadsheets/pdf_di...
...,...,...,...,...,...,...,...,...,...,...,...,...,...
6109,1804.02.26.R,1804.0,Boat,AUSTRALIA,New South Wales,"Georges Head, off Port Jackson",NaN,boat,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...
6110,1803.05.17,1803.0,Sea Disaster,USA,South Carolina,Off Charleston,NaN,Captain Jones,M,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...
6111,1803.03.00,1803.0,Unprovoked,AUSTRALIA,Western Australia,"Hamelin Harbour, at Faure Island",NaN,M. Lefevre & a sailor (rescuer),M,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...
6112,1802.04.13.R,1802.0,Unprovoked,INDIA,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...
6113,1801.12.18.R,1801.0,Provoked,NaN,NaN,NaN,Standing on landed shark's tail,Stephen Pettigew,N,NaN,NaN,12' shark,http://sharkattackfile.net/spreadsheets/pdf_di...

In [97]:
df_tibuhistorico33 = df_tibuhistorico.drop(["Unnamed: 22", "Unnamed: 23"], axis = 1)
df_tibuhistorico33

,Case Number,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Time,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order
6132,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,NaN,NaN,NaN,V. C. Harvey-Brain,1800.00.00-Corsair-boat.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1800.00.00,1800.00.00,171.0
6133,1797.05.28.R,1797.0,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,NaN,The Observer 5/28/1797,1797.05.28.R-Cloverdale.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1797.05.28.R,1797.05.28.R,170.0
6134,1792.09.12,1792.0,Provoked,ENGLAND,NaN,On the Thames River,Fishing,male,M,NaN,NaN,NaN,"The Waterford Herald, 9/15/1792",1792.09.12-Thames.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1792.09.12,1792.09.12,169.0
6135,1791.00.00,1791.0,Unprovoked,AUSTRALIA,New South Wales,Port Jackson,NaN,"female, an Australian aboriginal",F,NaN,NaN,NaN,"G.P. Whitley; D. Baldridge, p.162",1791.00.00-aboriginal woman.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1791.00.00,1791.00.00,168.0
6136,1788.05.10,1788.0,Boat,AUSTRALIA,New South Wales,Sydney Harbor,Fishing,boat,NaN,NaN,NaN,NaN,"G.P. Whitley citing J. Cobley, Sydney Cove, p....",1788.05.10-Sydney,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1788.05.10,1788.05.10,167.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6297,ND.0005,0.0,Unprovoked,AUSTRALIA,Western Australia,Roebuck Bay,Diving,male,M,NaN,NaN,NaN,"H. Taunton; N. Bartlett, p. 234",ND-0005-RoebuckBay.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,ND.0005,ND.0005,6.0
6298,ND.0004,0.0,Unprovoked,AUSTRALIA,Western Australia,NaN,Pearl diving,Ahmun,M,NaN,NaN,NaN,"H. Taunton; N. Bartlett, pp. 233-234",ND-0004-Ahmun.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,ND.0004,ND.0004,5.0
6299,ND.0003,0.0,Unprovoked,USA,North Carolina,Ocracoke Inlet,Swimming,Coast Guard personnel,M,NaN,NaN,NaN,"F. Schwartz, p.23; C. Creswell, GSAF",ND-0003-Ocracoke_1900-1905.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,ND.0003,ND.0003,4.0
6300,ND.0002,0.0,Unprovoked,PANAMA,NaN,"Panama Bay 8췈N, 79췈W",NaN,Jules Patterson,M,NaN,NaN,NaN,"The Sun, 10/20/1938",ND-0002-JulesPatterson.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,ND.0002,ND.0002,3.0
6301,ND.0001,0.0,Unprovoked,CEYLON (SRI LANKA),Eastern Province,"Below the English fort, Trincomalee",Swimming,male,M,15,NaN,NaN,S.W. Baker,ND-0001-Ceylon.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,ND.0001,ND.0001,2.0

In [118]:
lista_columnas_historico = {col: col.strip().replace(" ", "_").upper() for col in df_tibuhistorico33.columns}

In [120]:

lista_columnas_adicional = [col.strip().replace(" ", "_").upper() for col in df_tibuadicional.columns]

In [124]:
df_tiburones33.columns

Index(['Case Number', 'Year', 'Type', 'Country', 'Area', 'Location',
       'Activity', 'Name', 'Sex ', 'Age', 'Time', 'Species ', 'HREF'],
      dtype='object')

In [126]:
lista_columnas_tibu3 = [col.strip().replace(" ", "_").upper() for col in df_tiburones33.columns]

In [119]:
df_tibuhistorico33.columns

Index(['Case Number', 'Year', 'Type', 'Country', 'Area', 'Location',
       'Activity', 'Name', 'Sex ', 'Age', 'Time', 'Species ',
       'Investigator or Source', 'pdf', 'href formula', 'href',
       'Case Number.1', 'Case Number.2', 'original order'],
      dtype='object')

In [ ]:
#  쮼st치n todas en min칰sculas?

nombre_tibu3_col_minus = nombre_tibu3_col.lower()
nombre_tibuhistorico_col_minus = nombre_tibuhistorico_col.lower()
nombre_tibuadicional_col_minus = nombre_tibuadicional_col_minus.lower()

AttributeError: 'Index' object has no attribute 'lower'

In [ ]:
nombre_tibu3_col = list(nombre_tibu3_col)
nombre_tibu3_col = list(nombre_tibuhistorico_col)
nombre_tibu3_col = list(nombre_tibuadicional_col)

In [ ]:
type(nombre_tibu3_col)

list

In [ ]:
nombre_tibu3_col_minus = nombre_tibu3_col.lower()
nombre_tibuhistorico_col_minus = nombre_tibuhistorico_col.lower()
nombre_tibuadicional_col_minus = nombre_tibuadicional_col.lower()

AttributeError: 'list' object has no attribute 'lower'

In [ ]:
#  쮼st치n todas en min칰sculas?

In [ ]:

#  쯊ienen espacios?

In [ ]:
# En caso de que no sean todas iguales unificad el nombre de las columnas.

In [ ]:

# En este momento nos habremos dado cuenta que el DataFrame que generamos 
# en el pair programming Pandas IV es similar al DataFrame de los datos historicos.
# Si recordamos, eliminamos algunas columnas en la sesi칩n III que no eran 칰tiles,
#  pero esas columnas est치n todav칤a en el hist칩rico. Si no fuera por eso podr칤amos 
# unir esos dataframes. Realizad los cambios que creais necesarios para que los
#  dataframes sean iguales y luego juntadlos usando el mejor m칠todo.

In [ ]:
# Es el momento de unir la informaci칩n de todos los ataques de tibur칩n
#  que acabamos de crear con el DataFrame de informaci칩n adicional. 
# Debatid que m칠todo es el m치s correcto para unir toda esta informaci칩n 
# y ejecutadlo.